; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v4 - type_3 ?v3 - type_2)
 	      (pred_1 ?v8 - object ?v3 - type_2)
	      (pred_4 ?v4 - type_3 ?v6 - type_1)
	      (pred_2 ?v4 - type_3 ?v8 - object ?v6 - type_1))

   (:action op_1
       :parameters  (?v4 - type_3 ?v7 ?v5 - type_2)
       :precondition (and  (pred_3 ?v4 ?v7))
       :effect (and  (pred_3 ?v4 ?v5)
		     (not (pred_3 ?v4 ?v7))))

   (:action op_2
       :parameters (?v4 - type_3 ?v1 - object ?v2 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v2) (pred_3 ?v4 ?v2) (pred_4 ?v4 ?v6))
       :effect (and (pred_2 ?v4 ?v1 ?v6)
		    (not (pred_1 ?v1 ?v2)) 
		    (not (pred_4 ?v4 ?v6))))

   (:action op_3
       :parameters (?v4 - type_3 ?v1 - object ?v2 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_2 ?v4 ?v1 ?v6) (pred_3 ?v4 ?v2))
       :effect (and (pred_1 ?v1 ?v2)
		    (pred_4 ?v4 ?v6)
		    (not (pred_2 ?v4 ?v1 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_08 obj_11 - type_3
obj_03 obj_12 obj_02 obj_05 - type_1
obj_01 obj_04 obj_14 obj_09 - type_2
obj_10 obj_07 obj_13 obj_06 - object)
(:init
(pred_3 obj_08 obj_04)
(pred_4 obj_08 obj_03)
(pred_4 obj_08 obj_12)
(pred_3 obj_11 obj_01)
(pred_4 obj_11 obj_02)
(pred_4 obj_11 obj_05)
(pred_1 obj_10 obj_04)
(pred_1 obj_07 obj_04)
(pred_1 obj_13 obj_04)
(pred_1 obj_06 obj_01)
)
(:goal
(and
(pred_1 obj_10 obj_09)
(pred_1 obj_07 obj_14)
(pred_1 obj_13 obj_04)
(pred_1 obj_06 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_08 obj_09) (pred_3 obj_11 obj_09))))
  )
)
)

; plan
1. (op_2 obj_08 obj_10 obj_04 obj_12)
   deleted: (pred_1 obj_10 obj_04) (pred_4 obj_08 obj_12)
   added: (pred_2 obj_08 obj_10 obj_12)
   goals met: 1 of 4
2. (op_2 obj_08 obj_07 obj_04 obj_03)
   deleted: (pred_1 obj_07 obj_04) (pred_4 obj_08 obj_03)
   added: (pred_2 obj_08 obj_07 obj_03)
   goals met: 1 of 4
3. (op_2 obj_11 obj_06 obj_01 obj_05)
   deleted: (pred_1 obj_06 obj_01) (pred_4 obj_11 obj_05)
   added: (pred_2 obj_11 obj_06 obj_05)
   goals met: 1 of 4
4. (op_1 obj_08 obj_04 obj_14)
   deleted: (pred_3 obj_08 obj_04)
   added: (pred_3 obj_08 obj_14)
   goals met: 1 of 4
5. (op_1 obj_11 obj_01 obj_09)
   deleted: (pred_3 obj_11 obj_01)
   added: (pred_3 obj_11 obj_09)
   goals met: 1 of 4
6. (op_3 obj_08 obj_07 obj_14 obj_03)
   deleted: (pred_2 obj_08 obj_07 obj_03)
   added: (pred_1 obj_07 obj_14) (pred_4 obj_08 obj_03)
   goals met: 2 of 4
7. (op_3 obj_11 obj_06 obj_09 obj_05)
   deleted: (pred_2 obj_11 obj_06 obj_05)
   added: (pred_1 obj_06 obj_09) (pred_4 obj_11 obj_05)
   goals met: 3 of 4
8. (op_1 obj_11 obj_09 obj_01)
   deleted: (pred_3 obj_11 obj_09)
   added: (pred_3 obj_11 obj_01)
   goals met: 3 of 4
9. (op_1 obj_08 obj_14 obj_09)
   deleted: (pred_3 obj_08 obj_14)
   added: (pred_3 obj_08 obj_09)
   goals met: 3 of 4
10. (op_3 obj_08 obj_10 obj_09 obj_12)
   deleted: (pred_2 obj_08 obj_10 obj_12)
   added: (pred_1 obj_10 obj_09) (pred_4 obj_08 obj_12)
   goals met: 4 of 4
